app/controllers/posts_controller.rb

  def index
    respond_with Post.all
---
SELECT "posts".* FROM "posts"

  def show
    respond_with Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]

  def create
    respond_with Post.create(post_params)
---
INSERT INTO "posts" ("link", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["link", "dsdsd"], ["title", "sdsd"], ["created_at", "2015-11-17 11:14:30.664375"], ["updated_at", "2015-11-17 11:14:30.664375"]]

  def upvote
    post = Post.find(params[:id])
    post.increment!(:upvotes)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "posts" SET "upvotes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["upvotes", 1], ["updated_at", "2015-11-17 15:01:38.012086"], ["id", 3]]

  def downvote
    post = Post.find(params[:id])
    post.decrement!(:upvotes)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "posts" SET "upvotes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["upvotes", 11], ["updated_at", "2015-11-18 11:16:01.856112"], ["id", 3]]